# SwiftUI 计算器
> 这是一个使用 SwiftUI 构建的计算器应用，旨在重现原生 iOS 计算器的核心功能，并在此基础上添加了一些独特且有趣的新特性。对于 SwiftUI 的初学者和有经验的开发者来说，这都是一个很好的学习和实践项目。

## ✨ 主要功能

- **完整的计算器功能**:
    - 支持加、减、乘、除四则运算，并遵循运算优先级。
    - 支持百分比计算和正负号切换。
    - 支持连续计算，可以无缝进行下一次运算。
    - 支持通过左/右滑动来删除最后输入的数字。
- **便捷的交互**:
    - 触感反馈: 为按键点击提供了触感反馈，可在设置中开启或关闭。
    - 快速拷贝: 在主屏幕上使用 Haptic Touch 可以快速将上次的计算结果复制到剪贴板。
- **创新的文本替换功能**:
    - 通过“唤醒关键词 + 长按”手势激活。
    - 在设置中自定义触发码和替换短语。
    - Emoji 雨: 当替换的短语中包含特定的 Emoji 时，会触发有趣的 Emoji 雨效果！效果的持续时间和频率均可在设置中调整。
- **多语言支持**:
    - 支持中文和英文。

效果图如下

<img src="PreviewImage.png" alt="PreviewImage"  />

使用指南见：[SwiftUI 计算器使用指南](https://jo-cruise.github.io/posts/SwiftUICalculatorIntroduction/)
